src/DataProcessors/ЖурналВерсийОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ЖурналВерсийОбъектов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>// ПОКА НЕ ИСПОЛЬЗУЕТСЯ!!!</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньРаскрытияГруппировок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ЖурналВерсийОбъектов/Forms/ФормаСравненияВерсий/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектСтарыйXML       = Параметры.Объект1;
	ОбъектНовыйXML        = Параметры.Объект2;
	ОбъектВерсионирования = Параметры.Объект;
	ДатаПредыдущейВерсии  = Параметры.Дата1;
	ДатаТекущейВерсии     = Параметры.Дата2;
	Пользователь          = Параметры.Пользователь;
	Компьютер             = Параметры.Компьютер;
	Событие               = Параметры.Событие;
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьДерево()
	ТипОбъекта = ТипЗнч(ОбъектВерсионирования);
	
	// Очистка
	ДеревоИзменений.ПолучитьЭлементы().Очистить();
	
	ВеткаРодителя = ДеревоИзменений.ПолучитьЭлементы().Добавить();
	
	ВеткаРодителя.Объект       = ОбъектВерсионирования;
	ВеткаРодителя.Период       = ДатаТекущейВерсии;
	ВеткаРодителя.Пользователь = Пользователь;
	ВеткаРодителя.Компьютер    = Компьютер;
	ВеткаРодителя.Событие      = Событие;
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		ВеткаРодителя.НомерМакета = 4;
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		ВеткаРодителя.НомерМакета = 5;
	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		ВеткаРодителя.НомерМакета = 4;
	Иначе
		ВеткаРодителя.НомерМакета = 4; // Непонятно что. Считаем, что справочник
	КонецЕсли;
	
	Таблица = ВерсионированиеОбъектовПлатформа.ОпределитьРазличиеВерсийОбъекта(ОбъектСтарыйXML, ОбъектНовыйXML);
	
	Таблица.Сортировать("ИмяТЧ, НомерСтроки, НомерМетаданные");
	
	ВеткаТЧ = Неопределено;
	ТекТЧ = "";
	ВеткаСтрокаТЧ = Неопределено;
	ТекСтрокаТЧ = 0;
	Для Каждого ТекСтрока Из Таблица Цикл
		
		Если ТекСтрока.ИмяТЧ = "Реквизиты" Тогда
			
			НоваяСтрока = ВеткаРодителя.ПолучитьЭлементы().Добавить();
			НоваяСтрока.Объект = ТекСтрока.Реквизит;
			НоваяСтрока.СтароеЗначение = ТекСтрока.СтароеЗначение;
			НоваяСтрока.НовоеЗначение  = ТекСтрока.НовоеЗначение;
			НоваяСтрока.НомерМакета = 7; // Реквизит
			Продолжить;
			
		КонецЕсли;
		
		Если ТекТЧ <> ТекСтрока.ИмяТЧ Тогда
			ТекСтрокаТЧ = 0;
			НоваяСтрока = ВеткаРодителя.ПолучитьЭлементы().Добавить();
			
			ТекТЧ = ТекСтрока.ИмяТЧ;
			ВеткаТЧ = НоваяСтрока;
			
			НоваяСтрока.Объект = Сред(ТекТЧ, 4);
			НоваяСтрока.НомерМакета = 6; // Табличная часть
			
		КонецЕсли;
		
		Если ТекСтрокаТЧ <> ТекСтрока.НомерСтроки Тогда
			
			ТекСтрокаТЧ = ТекСтрока.НомерСтроки;
			ВеткаСтрокаТЧ = ВеткаТЧ.ПолучитьЭлементы().Добавить();
			ВеткаСтрокаТЧ.Объект = "Строка №" + СокрЛП(ТекСтрокаТЧ);
			ВеткаСтрокаТЧ.НомерМакета = 8; // Строка ТЧ
			
		КонецЕсли;
		
		НоваяСтрока = ВеткаСтрокаТЧ.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Объект = ТекСтрока.Реквизит;
		НоваяСтрока.СтароеЗначение = ТекСтрока.СтароеЗначение;
		НоваяСтрока.НовоеЗначение  = ТекСтрока.НовоеЗначение;
		НоваяСтрока.НомерМакета = 7; // Реквизит
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПостроитьДерево();
	
	// Развернем дерево
	ПерваяСтрока = ДеревоИзменений.ПолучитьЭлементы()[0].ПолучитьИдентификатор();
	Элементы.ДеревоИзменений.Развернуть(ПерваяСтрока, Истина);
	
КонецПроцедуры
